ERPDeveloper3.РасчетЦены/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="04d21f40-f0d4-4b66-80fd-727baaa42565">
  <name>Номенклатура</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Catalog>

ERPDeveloper3.РасчетЦены/src/InformationRegisters/УчетЦенНоменклатуры/УчетЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc58ded6-6ab7-4275-85fa-9e029095e031">
  <name>УчетЦенНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="9b955e2b-b3d7-462b-b1f9-7fafd2f3bb8a">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="bad95542-06ad-4716-b31a-3a9735e85bf3">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERPDeveloper3.РасчетЦены/src/Catalogs/Номенклатура/Forms/РЦ_ФормаСписка/Module.bsl
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Заголовок = СформироватьЗаголовокФормы(Элемент.ТекущаяСтрока);
КонецПроцедуры  

&НаСервереБезКонтекста
Функция СформироватьЗаголовокФормы(Номенклатура)
	Если Номенклатура.ЭтоГруппа Тогда
		Возврат "";	
	КонецЕсли;
	
	Цена = РегистрыСведений.УчетЦенНоменклатуры.ПолучитьЦенуНоменклатуры(Номенклатура);
	
	Возврат СтрШаблон("%1. Цена = %2", Номенклатура, Цена);
КонецФункции // СформироватьЗаголовокФормы
